starter-kit-misc-recommended.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Misc Recommended</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Starter Kit Misc Recommended"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-12-12 14:03:19 MST"/>
<meta name="author" content="Eric Schulte"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="emacs.css" type="text/css"/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Starter Kit Misc Recommended</h1>

<p>This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Starter Kit Misc</h2>
<div class="outline-text-2" id="text-1">

<p>Things that don't fit anywhere else, and which aren't quite universal
enough to live in <code>starter-kit-misc.org</code>.
</p>

</div>

<div id="outline-container-window-system" class="outline-3">
<h3 id="window-system"><a name="sec-1-1" id="sec-1-1"></a>Window systems &ndash; remove visual cruft &nbsp;&nbsp;&nbsp;<span class="tag"><span class="visual">visual</span></span></h3>
<div class="outline-text-3" id="text-window-system">




<pre class="src src-emacs-lisp"><span class="org-starter-kit-paren">(</span><span class="org-keyword">when</span> window-system
  <span class="org-starter-kit-paren">(</span>tooltip-mode -1<span class="org-starter-kit-paren">)</span>
  <span class="org-starter-kit-paren">(</span>tool-bar-mode -1<span class="org-starter-kit-paren">))</span>
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">No Menu Bar &nbsp;&nbsp;&nbsp;<span class="tag"><span class="visual">visual</span></span></h3>
<div class="outline-text-3" id="text-1-2">

<p>You really don't need this; trust me.
</p>


<pre class="src src-emacs-lisp"><span class="org-starter-kit-paren">(</span>menu-bar-mode -1<span class="org-starter-kit-paren">)</span>
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Nxhtml &ndash; utilities for we development</h3>
<div class="outline-text-3" id="text-1-3">

<p><a href="http://ourcomments.org/Emacs/nXhtml/doc/nxhtml.html">Nxhtml</a> is a large package of utilities for web development and for
embedding multiple major modes in a single buffer.
</p>
<p>
Nxhtml is not installed in this version of the starter-kit by default,
for information on installing nxhtml see <a href="http://www.emacswiki.org/emacs/NxhtmlMode">EmacsWiki-Nxhtml</a>.
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Set browser</h3>
<div class="outline-text-3" id="text-1-4">

<p>Set this to whatever browser you use e.g&hellip;
</p><pre class="example">
;; (setq browse-url-browser-function 'browse-url-firefox)
;; (setq browse-url-browser-function 'browse-default-macosx-browser)
;; (setq browse-url-browser-function 'browse-default-windows-browser)
;; (setq browse-url-browser-function 'browse-default-kde)
;; (setq browse-url-browser-function 'browse-default-epiphany)
;; (setq browse-url-browser-function 'browse-default-w3m)
;; (setq browse-url-browser-function 'browse-url-generic
;;       browse-url-generic-program "~/src/conkeror/conkeror")
</pre>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">Associate modes with file extensions</h3>
<div class="outline-text-3" id="text-1-5">




<pre class="src src-emacs-lisp"><span class="org-starter-kit-paren">(</span>add-to-list 'auto-mode-alist '<span class="org-starter-kit-paren">(</span><span class="org-string">"COMMIT_EDITMSG$"</span> . diff-mode<span class="org-starter-kit-paren">))</span>
<span class="org-starter-kit-paren">(</span>add-to-list 'auto-mode-alist '<span class="org-starter-kit-paren">(</span><span class="org-string">"\\.css$"</span> . css-mode<span class="org-starter-kit-paren">))</span>
<span class="org-starter-kit-paren">(</span><span class="org-keyword">require</span> '<span class="org-constant">yaml-mode</span><span class="org-starter-kit-paren">)</span>
<span class="org-starter-kit-paren">(</span>add-to-list 'auto-mode-alist '<span class="org-starter-kit-paren">(</span><span class="org-string">"\\.ya?ml$"</span> . yaml-mode<span class="org-starter-kit-paren">))</span>
<span class="org-starter-kit-paren">(</span>add-to-list 'auto-mode-alist '<span class="org-starter-kit-paren">(</span><span class="org-string">"\\.rb$"</span> . ruby-mode<span class="org-starter-kit-paren">))</span>
<span class="org-starter-kit-paren">(</span>add-to-list 'auto-mode-alist '<span class="org-starter-kit-paren">(</span><span class="org-string">"Rakefile$"</span> . ruby-mode<span class="org-starter-kit-paren">))</span>
<span class="org-starter-kit-paren">(</span>add-to-list 'auto-mode-alist '<span class="org-starter-kit-paren">(</span><span class="org-string">"\\.js</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">on</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">?$"</span> . js2-mode<span class="org-starter-kit-paren">))</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(add-to-list 'auto-mode-alist '("\\.xml$" . nxml-mode))</span>
</pre>


</div>
</div>
</div>
</div>

</body>
</html>
